<template>
    <!-- 人口流入图层 -->
    <div class="pop_in">
        <VueDeckgl :layers="layers" :viewState="viewState"
        @click="handleClick" @view-state-change="updateViewState">
        </VueDeckgl>
        <div class="pop_table">
            <div class="title">人口流出</div>
            <div class="cont">
                <div class="name" style="color:#fff">流出城市</div>
                <div class="name" style="color:#fff">强度</div>
            </div>
            <div class="contents">
                <div class="cont" v-for="item in moveInCity" :key="item.name" @click="flyCity(item)">
                    <div class="name">{{item.name}}</div>
                    <div class="val">{{parseInt(item.val)}}</div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import VueDeckgl from 'vue-deck.gl'
import { mapGetters } from 'vuex'
import { Deck } from '@deck.gl/core'
import { IconLayer,LineLayer } from '@deck.gl/layers'
import { TripsLayer,GreatCircleLayer } from '@deck.gl/geo-layers'

export default {
    name:'pop_home',
    props:{
        
    },
    components:{
        VueDeckgl
    },
    data(){
        return {
            viewState: {
                longitude: localStorage.getItem('cityCenter')?JSON.parse(localStorage.getItem('cityCenter'))[0]:104.063115,
                latitude: localStorage.getItem('cityCenter')?JSON.parse(localStorage.getItem('cityCenter'))[1]:30.669457,
                zoom: 8,
                bearing: 0,
                pitch: 0,
            },
            time:0,
            moveIn:[ //成都迁入数据
                {path: [[104.404419364964,31.1331150036568],[104.072747,30.578993]],timestamps:[0,1000],val:2254.7},
                {path: [[103.856563315795,30.0825261194211],[104.072747,30.578993]],timestamps:[0,1000],val:2055.92},
                {path: [[104.685561860761,31.4736630487459],[104.072747,30.578993]],timestamps:[0,1000],val:1446.23},
                {path: [[106.558434155377,29.5689962453389],[104.072747,30.578993]],timestamps:[0,1000],val:1374.49},
                {path: [[106.117502614872,30.843782508337],[104.072747,30.578993]],timestamps:[0,1000],val:1217.48},
                {path: [[104.634435341644,30.1349565592531],[104.072747,30.578993]],timestamps:[0,1000],val:1216.46},
                {path: [[103.772537603635,29.5579407174581],[104.072747,30.578993]],timestamps:[0,1000],val:993.93},
                {path: [[105.064588024997,29.5858865383205],[104.072747,30.578993]],timestamps:[0,1000],val:956.780000000001},
                {path: [[105.599421530644,30.5390976711091],[104.072747,30.578993]],timestamps:[0,1000],val:848.34},
                {path: [[102.23141546175,31.9055115772665],[104.072747,30.578993]],timestamps:[0,1000],val:722.37},
                {path: [[104.649403704869,28.7580070285518],[104.072747,30.578993]],timestamps:[0,1000],val:654.79},
                {path: [[103.049542623605,30.0167925457061],[104.072747,30.578993]],timestamps:[0,1000],val:646.63},
                {path: [[107.474593858975,31.2143077239275],[104.072747,30.578993]],timestamps:[0,1000],val:609.07},
                {path: [[104.784448846717,29.3455849213276],[104.072747,30.578993]],timestamps:[0,1000],val:540.21},
                {path: [[106.751585303165,31.8728885859565],[104.072747,30.578993]],timestamps:[0,1000],val:504.76},
                {path: [[102.27350268097,27.8877523003697],[104.072747,30.578993]],timestamps:[0,1000],val:490.97},
                {path: [[105.850423181665,32.4416163053154],[104.072747,30.578993]],timestamps:[0,1000],val:478.02},
                {path: [[105.448524069327,28.8776683036072],[104.072747,30.578993]],timestamps:[0,1000],val:437.11},
                {path: [[106.639552682335,30.461746110679],[104.072747,30.578993]],timestamps:[0,1000],val:330.33},
                {path: [[101.96854674579,30.0552788435184],[104.072747,30.578993]],timestamps:[0,1000],val:286.82},
                {path: [[116.413383697123,39.9109245472996],[104.072747,30.578993]],timestamps:[0,1000],val:256.56},
                {path: [[121.480538860177,31.235929042252],[104.072747,30.578993]],timestamps:[0,1000],val:184.6},
                {path: [[108.946465550633,34.347268816624],[104.072747,30.578993]],timestamps:[0,1000],val:182.34},
                {path: [[101.725541170914,26.588033173333],[104.072747,30.578993]],timestamps:[0,1000],val:145.88},
                {path: [[114.064551836588,22.5484566379842],[104.072747,30.578993]],timestamps:[0,1000],val:135.9},
                {path: [[102.839445123261,24.8862721116441],[104.072747,30.578993]],timestamps:[0,1000],val:125.19},
                {path: [[113.27143134446,23.135336306695],[104.072747,30.578993]],timestamps:[0,1000],val:114.77},
                {path: [[106.636576763528,26.6533248223098],[104.072747,30.578993]],timestamps:[0,1000],val:105.05},
                {path: [[120.215511803722,30.2530829816935],[104.072747,30.578993]],timestamps:[0,1000],val:74.16},
                {path: [[114.311581554732,30.598466736401],[104.072747,30.578993]],timestamps:[0,1000],val:68.96},
                {path: [[107.037922956771,27.7283253344166],[104.072747,30.578993]],timestamps:[0,1000],val:67.36},
                {path: [[91.1784542562848,29.6594878798307],[104.072747,30.578993]],timestamps:[0,1000],val:64.02},
                {path: [[103.723511771969,27.3440838602468],[104.072747,30.578993]],timestamps:[0,1000],val:63.21},
                {path: [[109.518556701399,18.2587362917479],[104.072747,30.578993]],timestamps:[0,1000],val:62.85},
                {path: [[112.945473195353,28.2348893999436],[104.072747,30.578993]],timestamps:[0,1000],val:55.61},
                {path: [[118.802421721246,32.0646528856185],[104.072747,30.578993]],timestamps:[0,1000],val:53.62},
                {path: [[113.631419207339,34.7534388504545],[104.072747,30.578993]],timestamps:[0,1000],val:52.25},
                {path: [[103.840521196336,36.0672346935456],[104.072747,30.578993]],timestamps:[0,1000],val:51.07},
                {path: [[117.208092752977,39.0911025984355],[104.072747,30.578993]],timestamps:[0,1000],val:47.78},
                {path: [[107.029430209265,33.0737999078338],[104.072747,30.578993]],timestamps:[0,1000],val:44.58},
                {path: [[120.592412229593,31.3035640744418],[104.072747,30.578993]],timestamps:[0,1000],val:44.43},
                {path: [[113.758420457876,23.0273084116434],[104.072747,30.578993]],timestamps:[0,1000],val:41.13},
                {path: [[101.784450170509,36.6233846965166],[104.072747,30.578993]],timestamps:[0,1000],val:37.2},
                {path: [[87.6244399353605,43.8307632042905],[104.072747,30.578993]],timestamps:[0,1000],val:33.52},
                {path: [[113.128512195497,23.0277587507889],[104.072747,30.578993]],timestamps:[0,1000],val:31.36},
                {path: [[108.373450825819,22.8226066011872],[104.072747,30.578993]],timestamps:[0,1000],val:31.34},
                {path: [[117.233442664977,31.8265778336869],[104.072747,30.578993]],timestamps:[0,1000],val:30.13},
                {path: [[119.30346983854,26.0804294206981],[104.072747,30.578993]],timestamps:[0,1000],val:30.13},
                {path: [[118.096435499767,24.4854066051763],[104.072747,30.578993]],timestamps:[0,1000],val:29.08},
                {path: [[105.298588795011,27.2902150834259],[104.072747,30.578993]],timestamps:[0,1000],val:29.07},
                {path: [[120.389455191146,36.0722274966632],[104.072747,30.578993]],timestamps:[0,1000],val:28.83},
                {path: [[120.706476890356,28.0010854044722],[104.072747,30.578993]],timestamps:[0,1000],val:28.58},
                {path: [[104.966864344769,33.3760321591092],[104.072747,30.578993]],timestamps:[0,1000],val:28.24},
                {path: [[117.12639941261,36.6565542017872],[104.072747,30.578993]],timestamps:[0,1000],val:28.11},
                {path: [[114.521531901574,38.0483119268727],[104.072747,30.578993]],timestamps:[0,1000],val:26.74},
                {path: [[120.318583288106,31.4988097326857],[104.072747,30.578993]],timestamps:[0,1000],val:26.71},
                {path: [[121.630842781856,29.8660681240696],[104.072747,30.578993]],timestamps:[0,1000],val:26.3},
                {path: [[115.864589442317,28.6894552950607],[104.072747,30.578993]],timestamps:[0,1000],val:24.35},
                {path: [[108.715422451433,34.3354762933686],[104.072747,30.578993]],timestamps:[0,1000],val:24.31},
                {path: [[123.471096644823,41.6838300691907],[104.072747,30.578993]],timestamps:[0,1000],val:23.64},
                {path: [[112.556391491672,37.8769890288478],[104.072747,30.578993]],timestamps:[0,1000],val:22.52},
                {path: [[100.274582840484,25.6121284181925],[104.072747,30.578993]],timestamps:[0,1000],val:21.22},
                {path: [[126.541615090317,45.8088258279522],[104.072747,30.578993]],timestamps:[0,1000],val:20.87},
                {path: [[110.20671989642,20.0521130861804],[104.072747,30.578993]],timestamps:[0,1000],val:19.83},
                {path: [[107.24457536704,34.36891564287],[104.072747,30.578993]],timestamps:[0,1000],val:18.43},
                {path: [[100.232464529035,26.8606574380649],[104.072747,30.578993]],timestamps:[0,1000],val:18.27},
                {path: [[118.682446266804,24.8799523304983],[104.072747,30.578993]],timestamps:[0,1000],val:18.23},
                {path: [[100.803446824556,22.0136012547642],[104.072747,30.578993]],timestamps:[0,1000],val:17.65},
                {path: [[109.126533212566,21.4868364957694],[104.072747,30.578993]],timestamps:[0,1000],val:17.47},
                {path: [[115.471463837686,38.8799877684553],[104.072747,30.578993]],timestamps:[0,1000],val:17.07},
                {path: [[125.330602075907,43.8219535010431],[104.072747,30.578993]],timestamps:[0,1000],val:16.88},
                {path: [[110.186194873152,25.241698783544],[104.072747,30.578993]],timestamps:[0,1000],val:16.45},
                {path: [[112.459421298311,34.6242627792194],[104.072747,30.578993]],timestamps:[0,1000],val:16.03},
                {path: [[119.653436190529,29.0846393855137],[104.072747,30.578993]],timestamps:[0,1000],val:15.32},
                {path: [[109.516589605259,34.5057155167526],[104.072747,30.578993]],timestamps:[0,1000],val:15.03},
                {path: [[111.013389454479,35.0327069129092],[104.072747,30.578993]],timestamps:[0,1000],val:14.49},
                {path: [[121.621631484593,38.9189536667856],[104.072747,30.578993]],timestamps:[0,1000],val:14.44},
                {path: [[106.2384935874,38.4924600555096],[104.072747,30.578993]],timestamps:[0,1000],val:14.26},
                {path: [[113.582554786549,22.2765646542492],[104.072747,30.578993]],timestamps:[0,1000],val:14.19},
                {path: [[120.76355182586,30.7509748309201],[104.072747,30.578993]],timestamps:[0,1000],val:14.08},
                {path: [[107.528402705737,26.2606161960738],[104.072747,30.578993]],timestamps:[0,1000],val:13.21},
                {path: [[119.981484713279,31.8157956533278],[104.072747,30.578993]],timestamps:[0,1000],val:13.11},
                {path: [[114.423558016582,23.1163588547256],[104.072747,30.578993]],timestamps:[0,1000],val:13.07},
                {path: [[97.1773332489529,31.1486618108102],[104.072747,30.578993]],timestamps:[0,1000],val:12.75},
                {path: [[116.690581733425,39.5433666627585],[104.072747,30.578993]],timestamps:[0,1000],val:12.62},
                {path: [[103.802434827947,25.4964069315437],[104.072747,30.578993]],timestamps:[0,1000],val:12.54},
                {path: [[111.292549210354,30.6974464844924],[104.072747,30.578993]],timestamps:[0,1000],val:12.02},
                {path: [[117.290575434395,34.2126665501131],[104.072747,30.578993]],timestamps:[0,1000],val:12.01},
                {path: [[113.399422362632,22.5223146707905],[104.072747,30.578993]],timestamps:[0,1000],val:10.66},
                {path: [[121.42743470428,28.6621940559961],[104.072747,30.578993]],timestamps:[0,1000],val:10.3},
                {path: [[112.534501313513,32.9965622046514],[104.072747,30.578993]],timestamps:[0,1000],val:10.21},
                {path: [[120.901591738662,31.9865494312009],[104.072747,30.578993]],timestamps:[0,1000],val:9.83999999999999},
                {path: [[109.494592618575,30.2779395753011],[104.072747,30.578993]],timestamps:[0,1000],val:9.55},
                {path: [[118.363533005014,35.1106712423651],[104.072747,30.578993]],timestamps:[0,1000],val:9.12},
                {path: [[114.545628228235,36.631262731204],[104.072747,30.578993]],timestamps:[0,1000],val:9.1},
                {path: [[104.837554602347,26.5988331082575],[104.072747,30.578993]],timestamps:[0,1000],val:8.75},
                {path: [[119.168377911428,36.7126515512675],[104.072747,30.578993]],timestamps:[0,1000],val:8.61999999999999},
                {path: [[110.044464092548,18.5123315956988],[104.072747,30.578993]],timestamps:[0,1000],val:7.06},
                {path: [[91.778675138519,29.2430269392492],[104.072747,30.578993]],timestamps:[0,1000],val:7.05999999999999},
                {path: [[111.755508561709,40.8484229971135],[104.072747,30.578993]],timestamps:[0,1000],val:6.67},
            ],
            moveInCity:[ //迁入城市数据
                { name:'德阳市',coordinates:[104.404419364964,31.1331150036568],val:2254.7},
                { name:'眉山市',coordinates:[103.856563315795,30.0825261194211],val:2055.92},
                { name:'绵阳市',coordinates:[104.685561860761,31.4736630487459],val:1446.23},
                { name:'重庆市',coordinates:[106.558434155377,29.5689962453389],val:1374.49},
                { name:'南充市',coordinates:[106.117502614872,30.843782508337],val:1217.48},
                { name:'资阳市',coordinates:[104.634435341644,30.1349565592531],val:1216.46},
                { name:'乐山市',coordinates:[103.772537603635,29.5579407174581],val:993.93},
                { name:'内江市',coordinates:[105.064588024997,29.5858865383205],val:956.780000000001},
                { name:'遂宁市',coordinates:[105.599421530644,30.5390976711091],val:848.34},
                { name:'阿坝藏族羌族自治州',coordinates:[102.23141546175,31.9055115772665],val:722.37},
                { name:'宜宾市',coordinates:[104.649403704869,28.7580070285518],val:654.79},
                { name:'雅安市',coordinates:[103.049542623605,30.0167925457061],val:646.63},
                { name:'达州市',coordinates:[107.474593858975,31.2143077239275],val:609.07},
                { name:'自贡市',coordinates:[104.784448846717,29.3455849213276],val:540.21},
                { name:'巴中市',coordinates:[106.751585303165,31.8728885859565],val:504.76},
                { name:'凉山彝族自治州',coordinates:[102.27350268097,27.8877523003697],val:490.97},
                { name:'广元市',coordinates:[105.850423181665,32.4416163053154],val:478.02},
                { name:'泸州市',coordinates:[105.448524069327,28.8776683036072],val:437.11},
                { name:'广安市',coordinates:[106.639552682335,30.461746110679],val:330.33},
                { name:'甘孜藏族自治州',coordinates:[101.96854674579,30.0552788435184],val:286.82},
                { name:'北京市',coordinates:[116.413383697123,39.9109245472996],val:256.56},
                { name:'上海市',coordinates:[121.480538860177,31.235929042252],val:184.6},
                { name:'西安市',coordinates:[108.946465550633,34.347268816624],val:182.34},
                { name:'攀枝花市',coordinates:[101.725541170914,26.588033173333],val:145.88},
                { name:'深圳市',coordinates:[114.064551836588,22.5484566379842],val:135.9},
                { name:'昆明市',coordinates:[102.839445123261,24.8862721116441],val:125.19},
                { name:'广州市',coordinates:[113.27143134446,23.135336306695],val:114.77},
                { name:'贵阳市',coordinates:[106.636576763528,26.6533248223098],val:105.05},
                { name:'杭州市',coordinates:[120.215511803722,30.2530829816935],val:74.16},
                { name:'武汉市',coordinates:[114.311581554732,30.598466736401],val:68.96},
                { name:'遵义市',coordinates:[107.037922956771,27.7283253344166],val:67.36},
                { name:'拉萨市',coordinates:[91.1784542562848,29.6594878798307],val:64.02},
                { name:'昭通市',coordinates:[103.723511771969,27.3440838602468],val:63.21},
                { name:'三亚市',coordinates:[109.518556701399,18.2587362917479],val:62.85},
                { name:'长沙市',coordinates:[112.945473195353,28.2348893999436],val:55.61},
                { name:'南京市',coordinates:[118.802421721246,32.0646528856185],val:53.62},
                { name:'郑州市',coordinates:[113.631419207339,34.7534388504545],val:52.25},
                { name:'兰州市',coordinates:[103.840521196336,36.0672346935456],val:51.07},
                { name:'天津市',coordinates:[117.208092752977,39.0911025984355],val:47.78},
                { name:'汉中市',coordinates:[107.029430209265,33.0737999078338],val:44.58},
                { name:'苏州市',coordinates:[120.592412229593,31.3035640744418],val:44.43},
                { name:'东莞市',coordinates:[113.758420457876,23.0273084116434],val:41.13},
                { name:'西宁市',coordinates:[101.784450170509,36.6233846965166],val:37.2},
                { name:'乌鲁木齐市',coordinates:[87.6244399353605,43.8307632042905],val:33.52},
                { name:'佛山市',coordinates:[113.128512195497,23.0277587507889],val:31.36},
                { name:'南宁市',coordinates:[108.373450825819,22.8226066011872],val:31.34},
                { name:'合肥市',coordinates:[117.233442664977,31.8265778336869],val:30.13},
                { name:'福州市',coordinates:[119.30346983854,26.0804294206981],val:30.13},
                { name:'厦门市',coordinates:[118.096435499767,24.4854066051763],val:29.08},
                { name:'毕节市',coordinates:[105.298588795011,27.2902150834259],val:29.07},
                { name:'青岛市',coordinates:[120.389455191146,36.0722274966632],val:28.83},
                { name:'温州市',coordinates:[120.706476890356,28.0010854044722],val:28.58},
                { name:'陇南市',coordinates:[104.966864344769,33.3760321591092],val:28.24},
                { name:'济南市',coordinates:[117.12639941261,36.6565542017872],val:28.11},
                { name:'石家庄市',coordinates:[114.521531901574,38.0483119268727],val:26.74},
                { name:'无锡市',coordinates:[120.318583288106,31.4988097326857],val:26.71},
                { name:'宁波市',coordinates:[121.630842781856,29.8660681240696],val:26.3},
                { name:'南昌市',coordinates:[115.864589442317,28.6894552950607],val:24.35},
                { name:'咸阳市',coordinates:[108.715422451433,34.3354762933686],val:24.31},
                { name:'沈阳市',coordinates:[123.471096644823,41.6838300691907],val:23.64},
                { name:'太原市',coordinates:[112.556391491672,37.8769890288478],val:22.52},
                { name:'大理白族自治州',coordinates:[100.274582840484,25.6121284181925],val:21.22},
                { name:'哈尔滨市',coordinates:[126.541615090317,45.8088258279522],val:20.87},
                { name:'海口市',coordinates:[110.20671989642,20.0521130861804],val:19.83},
                { name:'宝鸡市',coordinates:[107.24457536704,34.36891564287],val:18.43},
                { name:'丽江市',coordinates:[100.232464529035,26.8606574380649],val:18.27},
                { name:'泉州市',coordinates:[118.682446266804,24.8799523304983],val:18.23},
                { name:'西双版纳傣族自治州',coordinates:[100.803446824556,22.0136012547642],val:17.65},
                { name:'北海市',coordinates:[109.126533212566,21.4868364957694],val:17.47},
                { name:'保定市',coordinates:[115.471463837686,38.8799877684553],val:17.07},
                { name:'长春市',coordinates:[125.330602075907,43.8219535010431],val:16.88},
                { name:'桂林市',coordinates:[110.186194873152,25.241698783544],val:16.45},
                { name:'洛阳市',coordinates:[112.459421298311,34.6242627792194],val:16.03},
                { name:'金华市',coordinates:[119.653436190529,29.0846393855137],val:15.32},
                { name:'渭南市',coordinates:[109.516589605259,34.5057155167526],val:15.03},
                { name:'运城市',coordinates:[111.013389454479,35.0327069129092],val:14.49},
                { name:'大连市',coordinates:[121.621631484593,38.9189536667856],val:14.44},
                { name:'银川市',coordinates:[106.2384935874,38.4924600555096],val:14.26},
                { name:'珠海市',coordinates:[113.582554786549,22.2765646542492],val:14.19},
                { name:'嘉兴市',coordinates:[120.76355182586,30.7509748309201],val:14.08},
                { name:'黔南布依族苗族自治州',coordinates:[107.528402705737,26.2606161960738],val:13.21},
                { name:'常州市',coordinates:[119.981484713279,31.8157956533278],val:13.11},
                { name:'惠州市',coordinates:[114.423558016582,23.1163588547256],val:13.07},
                { name:'昌都市',coordinates:[97.1773332489529,31.1486618108102],val:12.75},
                { name:'廊坊市',coordinates:[116.690581733425,39.5433666627585],val:12.62},
                { name:'曲靖市',coordinates:[103.802434827947,25.4964069315437],val:12.54},
                { name:'宜昌市',coordinates:[111.292549210354,30.6974464844924],val:12.02},
                { name:'徐州市',coordinates:[117.290575434395,34.2126665501131],val:12.01},
                { name:'中山市',coordinates:[113.399422362632,22.5223146707905],val:10.66},
                { name:'台州市',coordinates:[121.42743470428,28.6621940559961],val:10.3},
                { name:'南阳市',coordinates:[112.534501313513,32.9965622046514],val:10.21},
                { name:'南通市',coordinates:[120.901591738662,31.9865494312009],val:9.83999999999999},
                { name:'恩施土家族苗族自治州',coordinates:[109.494592618575,30.2779395753011],val:9.55},
                { name:'临沂市',coordinates:[118.363533005014,35.1106712423651],val:9.12},
                { name:'邯郸市',coordinates:[114.545628228235,36.631262731204],val:9.1},
                { name:'六盘水市',coordinates:[104.837554602347,26.5988331082575],val:8.75},
                { name:'潍坊市',coordinates:[119.168377911428,36.7126515512675],val:8.61999999999999},
                { name:'陵水黎族自治县',coordinates:[110.044464092548,18.5123315956988],val:7.06},
                { name:'山南市',coordinates:[91.778675138519,29.2430269392492],val:7.05999999999999},
                { name:'呼和浩特市',coordinates:[111.755508561709,40.8484229971135],val:6.67},
            ],
        }
    },
    computed:{
        layers(){
            let arr = this.setlayers()
            return arr
        },
        ...mapGetters(['ledger_map','mapIsload'])
    },
    watch:{
        mapIsload:{
            handler(newVal){
                if(newVal){
                    
                }
            },
        },
        
    },
    mounted(){
        var map = this.ledger_map
        var zoom = map.getZoom()
        var center = map.getCenter()
        this.viewState = {
            longitude: center.lng,
            latitude: center.lat,
            zoom: zoom,
            bearing: 0,
            pitch: 0,
        }
        this.animate()  
        this.mapEvents()
    },
    methods:{
        mapEvents(){
            var map = this.ledger_map
            map.on('zoom',e=>{
                var zoom = map.getZoom()
                var center = map.getCenter()
                this.viewState = {
                    longitude: center.lng,
                    latitude: center.lat,
                    zoom: zoom,
                    bearing: 0,
                    pitch: 0,
                }
            })
        },
        setlayers(){
            let arr = [
                // new LineLayer({
                //     id: 'tripLine',
                //     data:this.moveIn,
                //     pickable: true,
                //     getWidth: 3,
                //     getSourcePosition: d => d.path[0],
                //     getTargetPosition: d => d.path[1],
                //     getColor: [255,255,255,50],
                // }),
                new GreatCircleLayer({
                    id: 'tripLine',
                    data:this.moveIn,
                    pickable: true,
                    getWidth: 1,
                    getSourcePosition: d => d.path[0],
                    getTargetPosition: d => d.path[1],
                    getSourceColor: [255, 255, 255,50],
                    getTargetColor: [255, 255, 255,50]
                }),
                new IconLayer({
                    id: 'moveInCity',
                    data:this.moveInCity,
                    getIcon: d => ({
                        url: this.getIconColor(d),
                        width: 128,
                        height: 128,
                        anchorY: 128
                    }),
                    pickable: true,
                    sizeScale: 30,
                    getPosition: d => d.coordinates,
                }),
                new TripsLayer({
                    id: 'moveOutLine',
                    data:this.moveIn,
                    getPath: d => d.path,
                    getTimestamps: d => d.timestamps,
                    getColor: this.getColor,
                    opacity: 0.8,
                    widthMinPixels: 2,
                    rounded: true,
                    trailLength: 100,
                    currentTime: this.time,
                })
            ]
            return arr
        },
        getColor(d){
            let color
            if(d.val<=50){
                color = [0,185,255,255]
            }else if(d.val>50&&d.val<=400){
                color = [101,241,255,255]
            }else if(d.val>400&&d.val<=900){
                color = [255,179,63,255]
            }else if(d.val>900){
                color = [191,0,32,255] //红色
            }
            return color
        },
        getIconColor(d){
            let icon
            if(d.val<=50){
                icon = 'http://47.104.165.136:8099/test/color4.png'
            }else if(d.val>50&&d.val<=400){
                icon = 'http://47.104.165.136:8099/test/color3.png'
            }else if(d.val>400&&d.val<=900){
                icon = 'http://47.104.165.136:8099/test/color2.png'
            }else if(d.val>900){
                icon = 'http://47.104.165.136:8099/test/color1.png'
            }
            return icon
        },
        animate() {
            this.time += 3
            if(this.time>1200){
                this.time = 0
            }
            this.setlayers()
            this.animId = requestAnimationFrame(this.animate);
        },
        updateViewState(viewState) {
            //console.log("updating view state...");
            this.viewState = {
                ...viewState
            }
            this.ledger_map.jumpTo({
                center: [viewState.longitude, viewState.latitude],
                zoom: viewState.zoom,
                bearing: viewState.bearing,
                pitch: viewState.pitch,
            });
        },
        handleClick({ event, info }) {
            console.log(event,info)
        },
        flyCity(item){
            var map = this.ledger_map
            map.flyTo({
                center:item.coordinates,
                zoom:10
            })
        },
        
    }
}
</script>
<style lang="scss">
.pop_in{
    position: fixed;
    width: 100%;
    height: 100%;
    left: 0;
    top: 0;
    z-index: 0;
    .deckMap{
        position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%;
        background: #e5e9ec;
        overflow: hidden;
        z-index: 0;
    } 
    .pop_table{
      position: fixed;
      height: 86%;
      left: 110px;
      top: 50px;
      width: 200px;
      background: rgba(0,0,0,0.6);
      font-size: 12px;
      color: #fff;
      z-index: 3;
      .title{
          width: 100%;
          height: 50px;
          line-height: 50px;
          text-align: center;
      }
      .contents{
          height: calc(100% - 90px);
          overflow-y: scroll;
      }
      .cont{
        display: flex;
        align-items: center;
        width: 100%;
        height: 30px;
        .name,.val{
            width: 50%;
            text-align: center;
            color: #ff9800;
        }
        .name{
          color: #58ecff;
          transition: all 0.5s;
          cursor: pointer;
          &:hover{
            background: rgba(0, 137, 190, 0.6);
          }
        }
    }
    }
}

</style>