<template>
    <!-- 人口流出图层 -->
    <div class="pop_out">
        <VueDeckgl :layers="layers" :viewState="viewState"
        @click="handleClick" @view-state-change="updateViewState">
        </VueDeckgl>
        <div class="pop_table">
            <div class="title">人口流出</div>
            <div class="cont">
                <div class="name" style="color:#fff">流出城市</div>
                <div class="name" style="color:#fff">强度</div>
            </div>
            <div class="contents">
                <div class="cont" v-for="item in moveOutCity" :key="item.name" @click="flyCity(item)">
                    <div class="name">{{item.name}}</div>
                    <div class="val">{{parseInt(item.val)}}</div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import VueDeckgl from 'vue-deck.gl'
import { mapGetters } from 'vuex'
import { Deck } from '@deck.gl/core'
import { IconLayer,LineLayer } from '@deck.gl/layers'
import { TripsLayer,GreatCircleLayer } from '@deck.gl/geo-layers'

export default {
    name:'pop_home',
    props:{
        
    },
    components:{
        VueDeckgl
    },
    data(){
        return {
            viewState: {
                longitude: localStorage.getItem('cityCenter')?JSON.parse(localStorage.getItem('cityCenter'))[0]:104.063115,
                latitude: localStorage.getItem('cityCenter')?JSON.parse(localStorage.getItem('cityCenter'))[1]:30.669457,
                zoom: 8,
                bearing: 0,
                pitch: 0,
            },
            time:0,
            moveOut:[ //成都迁出数据
                {path: [[104.072747,30.578993],[104.404419364964,31.1331150036568]],timestamps:[0,1000],val:2351.01},
                {path: [[104.072747,30.578993],[103.856563315795,30.0825261194211]],timestamps:[0,1000],val:2327.31},
                {path: [[104.072747,30.578993],[104.685561860761,31.4736630487459]],timestamps:[0,1000],val:1395.25},
                {path: [[104.072747,30.578993],[106.558434155377,29.5689962453389]],timestamps:[0,1000],val:1346.05},
                {path: [[104.072747,30.578993],[104.634435341644,30.1349565592531]],timestamps:[0,1000],val:1246.84},
                {path: [[104.072747,30.578993],[106.117502614872,30.843782508337]],timestamps:[0,1000],val:1111.2},
                {path: [[104.072747,30.578993],[103.772537603635,29.5579407174581]],timestamps:[0,1000],val:1038.29},
                {path: [[104.072747,30.578993],[105.064588024997,29.5858865383205]],timestamps:[0,1000],val:922.11},
                {path: [[104.072747,30.578993],[105.599421530644,30.5390976711091]],timestamps:[0,1000],val:785.199999999999},
                {path: [[104.072747,30.578993],[102.23141546175,31.9055115772665]],timestamps:[0,1000],val:707.39},
                {path: [[104.072747,30.578993],[103.049542623605,30.0167925457061]],timestamps:[0,1000],val:700.369999999999},
                {path: [[104.072747,30.578993],[104.649403704869,28.7580070285518]],timestamps:[0,1000],val:629.97},
                {path: [[104.072747,30.578993],[107.474593858975,31.2143077239275]],timestamps:[0,1000],val:565.23},
                {path: [[104.072747,30.578993],[104.784448846717,29.3455849213276]],timestamps:[0,1000],val:514.87},
                {path: [[104.072747,30.578993],[102.27350268097,27.8877523003697]],timestamps:[0,1000],val:476.02},
                {path: [[104.072747,30.578993],[105.850423181665,32.4416163053154]],timestamps:[0,1000],val:458.3},
                {path: [[104.072747,30.578993],[106.751585303165,31.8728885859565]],timestamps:[0,1000],val:455.7},
                {path: [[104.072747,30.578993],[105.448524069327,28.8776683036072]],timestamps:[0,1000],val:413.35},
                {path: [[104.072747,30.578993],[106.639552682335,30.461746110679]],timestamps:[0,1000],val:310.49},
                {path: [[104.072747,30.578993],[101.96854674579,30.0552788435184]],timestamps:[0,1000],val:297.06},
                {path: [[104.072747,30.578993],[116.413383697123,39.9109245472996]],timestamps:[0,1000],val:239.32},
                {path: [[104.072747,30.578993],[108.946465550633,34.347268816624]],timestamps:[0,1000],val:191.72},
                {path: [[104.072747,30.578993],[121.480538860177,31.235929042252]],timestamps:[0,1000],val:170.48},
                {path: [[104.072747,30.578993],[102.839445123261,24.8862721116441]],timestamps:[0,1000],val:155.63},
                {path: [[104.072747,30.578993],[101.725541170914,26.588033173333]],timestamps:[0,1000],val:143.31},
                {path: [[104.072747,30.578993],[114.064551836588,22.5484566379842]],timestamps:[0,1000],val:138.17},
                {path: [[104.072747,30.578993],[106.636576763528,26.6533248223098]],timestamps:[0,1000],val:128.57},
                {path: [[104.072747,30.578993],[113.27143134446,23.135336306695]],timestamps:[0,1000],val:118.63},
                {path: [[104.072747,30.578993],[107.037922956771,27.7283253344166]],timestamps:[0,1000],val:79.2999999999999},
                {path: [[104.072747,30.578993],[103.723511771969,27.3440838602468]],timestamps:[0,1000],val:74.02},
                {path: [[104.072747,30.578993],[120.215511803722,30.2530829816935]],timestamps:[0,1000],val:73.65},
                {path: [[104.072747,30.578993],[91.1784542562848,29.6594878798307]],timestamps:[0,1000],val:68.4},
                {path: [[104.072747,30.578993],[107.029430209265,33.0737999078338]],timestamps:[0,1000],val:66.6},
                {path: [[104.072747,30.578993],[114.311581554732,30.598466736401]],timestamps:[0,1000],val:60.43},
                {path: [[104.072747,30.578993],[103.840521196336,36.0672346935456]],timestamps:[0,1000],val:59.27},
                {path: [[104.072747,30.578993],[109.518556701399,18.2587362917479]],timestamps:[0,1000],val:56.52},
                {path: [[104.072747,30.578993],[112.945473195353,28.2348893999436]],timestamps:[0,1000],val:55.21},
                {path: [[104.072747,30.578993],[113.631419207339,34.7534388504545]],timestamps:[0,1000],val:54.32},
                {path: [[104.072747,30.578993],[118.802421721246,32.0646528856185]],timestamps:[0,1000],val:51.52},
                {path: [[104.072747,30.578993],[113.758420457876,23.0273084116434]],timestamps:[0,1000],val:51.26},
                {path: [[104.072747,30.578993],[120.592412229593,31.3035640744418]],timestamps:[0,1000],val:44.12},
                {path: [[104.072747,30.578993],[101.784450170509,36.6233846965166]],timestamps:[0,1000],val:42.7},
                {path: [[104.072747,30.578993],[117.208092752977,39.0911025984355]],timestamps:[0,1000],val:39.32},
                {path: [[104.072747,30.578993],[108.373450825819,22.8226066011872]],timestamps:[0,1000],val:38.09},
                {path: [[104.072747,30.578993],[104.966864344769,33.3760321591092]],timestamps:[0,1000],val:37.11},
                {path: [[104.072747,30.578993],[105.298588795011,27.2902150834259]],timestamps:[0,1000],val:35.31},
                {path: [[104.072747,30.578993],[113.128512195497,23.0277587507889]],timestamps:[0,1000],val:33.51},
                {path: [[104.072747,30.578993],[118.096435499767,24.4854066051763]],timestamps:[0,1000],val:31.54},
                {path: [[104.072747,30.578993],[87.6244399353605,43.8307632042905]],timestamps:[0,1000],val:30.53},
                {path: [[104.072747,30.578993],[117.233442664977,31.8265778336869]],timestamps:[0,1000],val:28.9},
                {path: [[104.072747,30.578993],[121.630842781856,29.8660681240696]],timestamps:[0,1000],val:27.75},
                {path: [[104.072747,30.578993],[117.12639941261,36.6565542017872]],timestamps:[0,1000],val:27.33},
                {path: [[104.072747,30.578993],[119.30346983854,26.0804294206981]],timestamps:[0,1000],val:26.68},
                {path: [[104.072747,30.578993],[120.318583288106,31.4988097326857]],timestamps:[0,1000],val:25.55},
                {path: [[104.072747,30.578993],[108.715422451433,34.3354762933686]],timestamps:[0,1000],val:24.61},
                {path: [[104.072747,30.578993],[120.389455191146,36.0722274966632]],timestamps:[0,1000],val:24.23},
                {path: [[104.072747,30.578993],[115.864589442317,28.6894552950607]],timestamps:[0,1000],val:24.22},
                {path: [[104.072747,30.578993],[112.556391491672,37.8769890288478]],timestamps:[0,1000],val:23.77},
                {path: [[104.072747,30.578993],[123.471096644823,41.6838300691907]],timestamps:[0,1000],val:23.45},
                {path: [[104.072747,30.578993],[114.521531901574,38.0483119268727]],timestamps:[0,1000],val:23.32},
                {path: [[104.072747,30.578993],[100.274582840484,25.6121284181925]],timestamps:[0,1000],val:23.12},
                {path: [[104.072747,30.578993],[120.706476890356,28.0010854044722]],timestamps:[0,1000],val:21.86},
                {path: [[104.072747,30.578993],[110.20671989642,20.0521130861804]],timestamps:[0,1000],val:21.68},
                {path: [[104.072747,30.578993],[107.528402705737,26.2606161960738]],timestamps:[0,1000],val:21.68},
                {path: [[104.072747,30.578993],[100.232464529035,26.8606574380649]],timestamps:[0,1000],val:21.42},
                {path: [[104.072747,30.578993],[109.035601082657,32.6905127705738]],timestamps:[0,1000],val:20.27},
                {path: [[104.072747,30.578993],[110.186194873152,25.241698783544]],timestamps:[0,1000],val:19.4},
                {path: [[104.072747,30.578993],[103.802434827947,25.4964069315437]],timestamps:[0,1000],val:18.08},
                {path: [[104.072747,30.578993],[126.541615090317,45.8088258279522]],timestamps:[0,1000],val:17.93},
                {path: [[104.072747,30.578993],[118.682446266804,24.8799523304983]],timestamps:[0,1000],val:16.39},
                {path: [[104.072747,30.578993],[109.516589605259,34.5057155167526]],timestamps:[0,1000],val:16.03},
                {path: [[104.072747,30.578993],[107.24457536704,34.36891564287]],timestamps:[0,1000],val:16},
                {path: [[104.072747,30.578993],[109.494592618575,30.2779395753011]],timestamps:[0,1000],val:15.67},
                {path: [[104.072747,30.578993],[112.459421298311,34.6242627792194]],timestamps:[0,1000],val:15.66},
                {path: [[104.072747,30.578993],[113.582554786549,22.2765646542492]],timestamps:[0,1000],val:14.55},
                {path: [[104.072747,30.578993],[120.76355182586,30.7509748309201]],timestamps:[0,1000],val:14.2},
                {path: [[104.072747,30.578993],[100.803446824556,22.0136012547642]],timestamps:[0,1000],val:14.12},
                {path: [[104.072747,30.578993],[115.471463837686,38.8799877684553]],timestamps:[0,1000],val:13.61},
                {path: [[104.072747,30.578993],[109.126533212566,21.4868364957694]],timestamps:[0,1000],val:13.45},
                {path: [[104.072747,30.578993],[97.1773332489529,31.1486618108102]],timestamps:[0,1000],val:13.39},
                {path: [[104.072747,30.578993],[114.423558016582,23.1163588547256]],timestamps:[0,1000],val:13.39},
                {path: [[104.072747,30.578993],[106.2384935874,38.4924600555096]],timestamps:[0,1000],val:13.33},
                {path: [[104.072747,30.578993],[111.292549210354,30.6974464844924]],timestamps:[0,1000],val:13.17},
                {path: [[104.072747,30.578993],[111.013389454479,35.0327069129092]],timestamps:[0,1000],val:12.79},
                {path: [[104.072747,30.578993],[125.330602075907,43.8219535010431]],timestamps:[0,1000],val:11.93},
                {path: [[104.072747,30.578993],[104.837554602347,26.5988331082575]],timestamps:[0,1000],val:11.56},
                {path: [[104.072747,30.578993],[116.690581733425,39.5433666627585]],timestamps:[0,1000],val:11.49},
                {path: [[104.072747,30.578993],[107.989446240779,26.589702969826]],timestamps:[0,1000],val:11.46},
                {path: [[104.072747,30.578993],[119.981484713279,31.8157956533278]],timestamps:[0,1000],val:11.43},
                {path: [[104.072747,30.578993],[113.399422362632,22.5223146707905]],timestamps:[0,1000],val:11.32},
                {path: [[104.072747,30.578993],[119.653436190529,29.0846393855137]],timestamps:[0,1000],val:11.03},
                {path: [[104.072747,30.578993],[121.621631484593,38.9189536667856]],timestamps:[0,1000],val:10.7},
                {path: [[104.072747,30.578993],[105.954417123889,26.259252378715]],timestamps:[0,1000],val:10.08},
                {path: [[104.072747,30.578993],[112.534501313513,32.9965622046514]],timestamps:[0,1000],val:8.52999999999999},
                {path: [[104.072747,30.578993],[105.73141674567,34.5874118816506]],timestamps:[0,1000],val:7.99999999999999},
                {path: [[104.072747,30.578993],[101.534412480503,25.0517735653404]],timestamps:[0,1000],val:7.93},
                {path: [[104.072747,30.578993],[117.290575434395,34.2126665501131]],timestamps:[0,1000],val:7.82999999999999},
                {path: [[104.072747,30.578993],[114.545628228235,36.631262731204]],timestamps:[0,1000],val:7.62999999999999},
                {path: [[104.072747,30.578993],[112.128537201002,32.0147968046692]],timestamps:[0,1000],val:7.49999999999999},
                {path: [[104.072747,30.578993],[112.245522629261,30.3408421077429]],timestamps:[0,1000],val:7.1},
                {path: [[104.072747,30.578993],[111.755508561709,40.8484229971135]],timestamps:[0,1000],val:6.87},
            ],
            moveOutCity:[ //迁出城市数据
                { name:'德阳市',coordinates:[104.404419364964,31.1331150036568],val:2351.01},
                { name:'眉山市',coordinates:[103.856563315795,30.0825261194211],val:2327.31},
                { name:'绵阳市',coordinates:[104.685561860761,31.4736630487459],val:1395.25},
                { name:'重庆市',coordinates:[106.558434155377,29.5689962453389],val:1346.05},
                { name:'资阳市',coordinates:[104.634435341644,30.1349565592531],val:1246.84},
                { name:'南充市',coordinates:[106.117502614872,30.843782508337],val:1111.2},
                { name:'乐山市',coordinates:[103.772537603635,29.5579407174581],val:1038.29},
                { name:'内江市',coordinates:[105.064588024997,29.5858865383205],val:922.11},
                { name:'遂宁市',coordinates:[105.599421530644,30.5390976711091],val:785.199999999999},
                { name:'阿坝藏族羌族自治州',coordinates:[102.23141546175,31.9055115772665],val:707.39},
                { name:'雅安市',coordinates:[103.049542623605,30.0167925457061],val:700.369999999999},
                { name:'宜宾市',coordinates:[104.649403704869,28.7580070285518],val:629.97},
                { name:'达州市',coordinates:[107.474593858975,31.2143077239275],val:565.23},
                { name:'自贡市',coordinates:[104.784448846717,29.3455849213276],val:514.87},
                { name:'凉山彝族自治州',coordinates:[102.27350268097,27.8877523003697],val:476.02},
                { name:'广元市',coordinates:[105.850423181665,32.4416163053154],val:458.3},
                { name:'巴中市',coordinates:[106.751585303165,31.8728885859565],val:455.7},
                { name:'泸州市',coordinates:[105.448524069327,28.8776683036072],val:413.35},
                { name:'广安市',coordinates:[106.639552682335,30.461746110679],val:310.49},
                { name:'甘孜藏族自治州',coordinates:[101.96854674579,30.0552788435184],val:297.06},
                { name:'北京市',coordinates:[116.413383697123,39.9109245472996],val:239.32},
                { name:'西安市',coordinates:[108.946465550633,34.347268816624],val:191.72},
                { name:'上海市',coordinates:[121.480538860177,31.235929042252],val:170.48},
                { name:'昆明市',coordinates:[102.839445123261,24.8862721116441],val:155.63},
                { name:'攀枝花市',coordinates:[101.725541170914,26.588033173333],val:143.31},
                { name:'深圳市',coordinates:[114.064551836588,22.5484566379842],val:138.17},
                { name:'贵阳市',coordinates:[106.636576763528,26.6533248223098],val:128.57},
                { name:'广州市',coordinates:[113.27143134446,23.135336306695],val:118.63},
                { name:'遵义市',coordinates:[107.037922956771,27.7283253344166],val:79.2999999999999},
                { name:'昭通市',coordinates:[103.723511771969,27.3440838602468],val:74.02},
                { name:'杭州市',coordinates:[120.215511803722,30.2530829816935],val:73.65},
                { name:'拉萨市',coordinates:[91.1784542562848,29.6594878798307],val:68.4},
                { name:'汉中市',coordinates:[107.029430209265,33.0737999078338],val:66.6},
                { name:'武汉市',coordinates:[114.311581554732,30.598466736401],val:60.43},
                { name:'兰州市',coordinates:[103.840521196336,36.0672346935456],val:59.27},
                { name:'三亚市',coordinates:[109.518556701399,18.2587362917479],val:56.52},
                { name:'长沙市',coordinates:[112.945473195353,28.2348893999436],val:55.21},
                { name:'郑州市',coordinates:[113.631419207339,34.7534388504545],val:54.32},
                { name:'南京市',coordinates:[118.802421721246,32.0646528856185],val:51.52},
                { name:'东莞市',coordinates:[113.758420457876,23.0273084116434],val:51.26},
                { name:'苏州市',coordinates:[120.592412229593,31.3035640744418],val:44.12},
                { name:'西宁市',coordinates:[101.784450170509,36.6233846965166],val:42.7},
                { name:'天津市',coordinates:[117.208092752977,39.0911025984355],val:39.32},
                { name:'南宁市',coordinates:[108.373450825819,22.8226066011872],val:38.09},
                { name:'陇南市',coordinates:[104.966864344769,33.3760321591092],val:37.11},
                { name:'毕节市',coordinates:[105.298588795011,27.2902150834259],val:35.31},
                { name:'佛山市',coordinates:[113.128512195497,23.0277587507889],val:33.51},
                { name:'厦门市',coordinates:[118.096435499767,24.4854066051763],val:31.54},
                { name:'乌鲁木齐市',coordinates:[87.6244399353605,43.8307632042905],val:30.53},
                { name:'合肥市',coordinates:[117.233442664977,31.8265778336869],val:28.9},
                { name:'宁波市',coordinates:[121.630842781856,29.8660681240696],val:27.75},
                { name:'济南市',coordinates:[117.12639941261,36.6565542017872],val:27.33},
                { name:'福州市',coordinates:[119.30346983854,26.0804294206981],val:26.68},
                { name:'无锡市',coordinates:[120.318583288106,31.4988097326857],val:25.55},
                { name:'咸阳市',coordinates:[108.715422451433,34.3354762933686],val:24.61},
                { name:'青岛市',coordinates:[120.389455191146,36.0722274966632],val:24.23},
                { name:'南昌市',coordinates:[115.864589442317,28.6894552950607],val:24.22},
                { name:'太原市',coordinates:[112.556391491672,37.8769890288478],val:23.77},
                { name:'沈阳市',coordinates:[123.471096644823,41.6838300691907],val:23.45},
                { name:'石家庄市',coordinates:[114.521531901574,38.0483119268727],val:23.32},
                { name:'大理白族自治州',coordinates:[100.274582840484,25.6121284181925],val:23.12},
                { name:'温州市',coordinates:[120.706476890356,28.0010854044722],val:21.86},
                { name:'海口市',coordinates:[110.20671989642,20.0521130861804],val:21.68},
                { name:'黔南布依族苗族自治州',coordinates:[107.528402705737,26.2606161960738],val:21.68},
                { name:'丽江市',coordinates:[100.232464529035,26.8606574380649],val:21.42},
                { name:'安康市',coordinates:[109.035601082657,32.6905127705738],val:20.27},
                { name:'桂林市',coordinates:[110.186194873152,25.241698783544],val:19.4},
                { name:'曲靖市',coordinates:[103.802434827947,25.4964069315437],val:18.08},
                { name:'哈尔滨市',coordinates:[126.541615090317,45.8088258279522],val:17.93},
                { name:'泉州市',coordinates:[118.682446266804,24.8799523304983],val:16.39},
                { name:'渭南市',coordinates:[109.516589605259,34.5057155167526],val:16.03},
                { name:'宝鸡市',coordinates:[107.24457536704,34.36891564287],val:16},
                { name:'恩施土家族苗族自治州',coordinates:[109.494592618575,30.2779395753011],val:15.67},
                { name:'洛阳市',coordinates:[112.459421298311,34.6242627792194],val:15.66},
                { name:'珠海市',coordinates:[113.582554786549,22.2765646542492],val:14.55},
                { name:'嘉兴市',coordinates:[120.76355182586,30.7509748309201],val:14.2},
                { name:'西双版纳傣族自治州',coordinates:[100.803446824556,22.0136012547642],val:14.12},
                { name:'保定市',coordinates:[115.471463837686,38.8799877684553],val:13.61},
                { name:'北海市',coordinates:[109.126533212566,21.4868364957694],val:13.45},
                { name:'昌都市',coordinates:[97.1773332489529,31.1486618108102],val:13.39},
                { name:'惠州市',coordinates:[114.423558016582,23.1163588547256],val:13.39},
                { name:'银川市',coordinates:[106.2384935874,38.4924600555096],val:13.33},
                { name:'宜昌市',coordinates:[111.292549210354,30.6974464844924],val:13.17},
                { name:'运城市',coordinates:[111.013389454479,35.0327069129092],val:12.79},
                { name:'长春市',coordinates:[125.330602075907,43.8219535010431],val:11.93},
                { name:'六盘水市',coordinates:[104.837554602347,26.5988331082575],val:11.56},
                { name:'廊坊市',coordinates:[116.690581733425,39.5433666627585],val:11.49},
                { name:'黔东南苗族侗族自治州',coordinates:[107.989446240779,26.589702969826],val:11.46},
                { name:'常州市',coordinates:[119.981484713279,31.8157956533278],val:11.43},
                { name:'中山市',coordinates:[113.399422362632,22.5223146707905],val:11.32},
                { name:'金华市',coordinates:[119.653436190529,29.0846393855137],val:11.03},
                { name:'大连市',coordinates:[121.621631484593,38.9189536667856],val:10.7},
                { name:'安顺市',coordinates:[105.954417123889,26.259252378715],val:10.08},
                { name:'南阳市',coordinates:[112.534501313513,32.9965622046514],val:8.52999999999999},
                { name:'天水市',coordinates:[105.73141674567,34.5874118816506],val:7.99999999999999},
                { name:'楚雄彝族自治州',coordinates:[101.534412480503,25.0517735653404],val:7.93},
                { name:'徐州市',coordinates:[117.290575434395,34.2126665501131],val:7.82999999999999},
                { name:'邯郸市',coordinates:[114.545628228235,36.631262731204],val:7.62999999999999},
                { name:'襄阳市',coordinates:[112.128537201002,32.0147968046692],val:7.49999999999999},
                { name:'荆州市',coordinates:[112.245522629261,30.3408421077429],val:7.1},
                { name:'呼和浩特市',coordinates:[111.755508561709,40.8484229971135],val:6.87},
            ],
        }
    },
    computed:{
        layers(){
            let arr = this.setlayers()
            return arr
        },
        ...mapGetters(['ledger_map','mapIsload'])
    },
    watch:{
        mapIsload:{
            handler(newVal){
                if(newVal){
                    
                }
            },
        },
    },
    mounted(){
        var map = this.ledger_map
        var zoom = map.getZoom()
        var center = map.getCenter()
        this.viewState = {
            longitude: center.lng,
            latitude: center.lat,
            zoom: zoom,
            bearing: 0,
            pitch: 0,
        }
        this.animate()  
        this.mapEvents()
    },
    methods:{
        mapEvents(){
            var map = this.ledger_map
            map.on('zoom',e=>{
                var zoom = map.getZoom()
                var center = map.getCenter()
                this.viewState = {
                    longitude: center.lng,
                    latitude: center.lat,
                    zoom: zoom,
                    bearing: 0,
                    pitch: 0,
                }
            })
        },
        setlayers(){
            let arr = [
                // new LineLayer({
                //     id: 'tripLine',
                //     data:this.moveOut,
                //     pickable: true,
                //     getWidth: 3,
                //     getSourcePosition: d => d.path[0],
                //     getTargetPosition: d => d.path[1],
                //     getColor: [255,255,255,50],
                // }),
                new GreatCircleLayer({
                    id: 'tripLine',
                    data:this.moveOut,
                    pickable: true,
                    getWidth: 1,
                    getSourcePosition: d => d.path[0],
                    getTargetPosition: d => d.path[1],
                    getSourceColor: [255, 255, 255,50],
                    getTargetColor: [255, 255, 255,50]
                }),
                new IconLayer({
                    id: 'moveOutCity',
                    data:this.moveOutCity,
                    getIcon: d => ({
                        url: this.getIconColor(d),
                        width: 128,
                        height: 128,
                        anchorY: 128
                    }),
                    pickable: true,
                    sizeScale: 30,
                    getPosition: d => d.coordinates,
                }),
                new TripsLayer({
                    id: 'moveOutLine',
                    data:this.moveOut,
                    getPath: d => d.path,
                    getTimestamps: d => d.timestamps,
                    getColor: this.getColor,
                    opacity: 0.8,
                    widthMinPixels: 2,
                    rounded: true,
                    trailLength: 100,
                    currentTime: this.time,
                })
            ]
            return arr
        },
        getColor(d){
            let color
            if(d.val<=50){
                color = [0,185,255,255]
            }else if(d.val>50&&d.val<=400){
                color = [101,241,255,255]
            }else if(d.val>400&&d.val<=900){
                color = [255,179,63,255]
            }else if(d.val>900){
                color = [191,0,32,255] //红色
            }
            return color
        },
        getIconColor(d){
            let icon
            if(d.val<=50){
                icon = 'http://47.104.165.136:8099/test/color4.png'
            }else if(d.val>50&&d.val<=400){
                icon = 'http://47.104.165.136:8099/test/color3.png'
            }else if(d.val>400&&d.val<=900){
                icon = 'http://47.104.165.136:8099/test/color2.png'
            }else if(d.val>900){
                icon = 'http://47.104.165.136:8099/test/color1.png'
            }
            return icon
        },
        animate() {
            this.time += 3
            if(this.time>1200){
                this.time = 0
            }
            this.setlayers()
            this.animId = requestAnimationFrame(this.animate);
        },
        updateViewState(viewState) {
            //console.log("updating view state...");
            this.viewState = {
                ...viewState
            }
            this.ledger_map.jumpTo({
                center: [viewState.longitude, viewState.latitude],
                zoom: viewState.zoom,
                bearing: viewState.bearing,
                pitch: viewState.pitch,
            });
        },
        handleClick({ event, info }) {
            console.log(event,info)
        },
        flyCity(item){
            var map = this.ledger_map
            map.flyTo({
                center:item.coordinates,
                zoom:10
            })
        },
    }
}
</script>
<style lang="scss">
.pop_out{
    position: fixed;
    width: 100%;
    height: 100%;
    left: 0;
    top: 0;
    z-index: 0;
    .deckMap{
        position: fixed;
        top: 0;
        left: 0;
        width: 100%;
        height: 100%;
        background: #e5e9ec;
        overflow: hidden;
        z-index: 0;
    } 
    .pop_table{
      position: fixed;
      height: 86%;
      left: 110px;
      top: 50px;
      width: 200px;
      background: rgba(0,0,0,0.6);
      font-size: 12px;
      color: #fff;
      z-index: 3;
      .title{
          width: 100%;
          height: 50px;
          line-height: 50px;
          text-align: center;
      }
      .contents{
          height: calc(100% - 90px);
          overflow-y: scroll;
      }
      .cont{
        display: flex;
        align-items: center;
        width: 100%;
        height: 30px;
        .name,.val{
            width: 50%;
            text-align: center;
            color: #ff9800;
        }
        .name{
          color: #58ecff;
          transition: all 0.5s;
          cursor: pointer;
          &:hover{
            background: rgba(0, 137, 190, 0.6);
          }
        }
    }
    }
}

</style>